alefragnani.project-manager
alexanderte.dainty-vscode
Angular.ng-template
arcticicestudio.nord-visual-studio-code
astro-build.astro-vscode
benjaminbenais.copilot-theme
bradlc.vscode-tailwindcss
brittanychiang.halcyon-vscode
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
CodeStream.codestream
dahong.theme-bear
DaltonMenezes.aura-theme
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dnlytras.nord-wave
donjayamanne.githistory
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
eg2.vscode-npm-script
enkia.tokyo-night
Equinusocio.vsc-community-material-theme
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
gamunu.vscode-yarn
geisslerh.ayu-mirage-bold-italic
georgewfraser.vscode-javac
GitHub.github-vscode-theme
GitLab.gitlab-workflow
Gruntfuggly.todo-tree
hbenl.vscode-test-explorer
Heron.firefox-devtools-theme
hsnazar.hyper-term-theme
jock.svg
johnpapa.Angular2
juanmnl.vscode-theme-1984
k6.k6
kamikillerto.vscode-colorize
kettanaito.nako
kisstkondoros.vscode-gutter-preview
lokalise.i18n-ally
lucono.karma-test-explorer
mhutchie.git-graph
miguelsolorio.min-theme
mrmlnc.vscode-scss
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.test-adapter-converter
norato.storybook-snippets
oguhpereira.spotify-color-theme
oouo-diogo-perdigao.docthis
Orta.vscode-jest
PKief.material-icon-theme
pmndrs.pmndrs
pnp.polacode
pranaygp.vscode-css-peek
RaillyHugo.one-hunter
rbbit.typescript-hero
redhat.java
REditorSupport.r
ritwickdey.LiveServer
rust-lang.rust-analyzer
rvest.vs-code-prettier-eslint
Shan.code-settings-sync
sibiraj-s.vscode-scss-formatter
silofy.hackthebox
silvenon.mdx
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
SumitSaha.learn-with-sumit-theme
sveggiani.vscode-field-lights
svelte.svelte-vscode
tal7aouy.theme
tauri-apps.tauri-vscode
teabyii.ayu
tonybaloney.vscode-pets
usernamehw.errorlens
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
WallabyJs.quokka-vscode
wayou.vscode-todo-highlight
withfig.fig
wix.vscode-import-cost
xabikos.JasmineSnippets
xabikos.JavaScriptSnippets
yummygum.city-lights-theme
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
Zignd.html-css-class-completion
