# taps
tap "homebrew/bundle" 
tap "homebrew/cask-fonts" # nerd fonts
tap "arl/arl"
tap "max-sixty/worktrunk"

# packages
brew 'git' # version control
brew 'bob' # neovim version manager
brew 'tmux' # terminal mutliplexer
brew 'fish' # shell
brew 'bat' # cat(1) alternative
brew 'erdtree' # tree cmd
brew 'gh' # github cli
brew 'glab' # gitlab cli
brew 'starship' # prompt
brew 'fzf' # fuzzy-finder
brew 'docker' # container
brew 'mise' # version management
brew 'lazygit' # git tui
brew 'ast-grep' # ast-based search, modify, etc..
brew 'fisher' # fish plugin-manager
brew 'eza' # ls replacement
brew 'stow' # symlink manager
brew 'yazi' # file explorer
brew 'zoxide' # better cd
brew 'fd' # find replacement
brew 'ripgrep' # ripgrep
brew 'direnv' # direnv
brew 'commitizen' # commit-cli
brew 'btop' # resource monitor
brew 'atuin' # magic shell history
brew 'chafa' # image rendering
brew 'resvg' # svg rendering
brew 'git-delta' # diff pager
brew 'wt' # worktree cli 
brew 'opencode' # ai-agent
brew 'codex' # ai-agent
brew 'lazydocker' # docker TUI
brew 'sesh' # tmux session manager
 
# tmux plugins
brew 'gitmux'

# envs
brew 'go'
brew 'rust'
brew 'gcc'
brew 'bun'

# Casks
cask 'chrome' #its chrome
cask 'visual-studio-code' # text-editor 
cask '1password' # password manager
cask '1password-cli' # password manager cli
cask 'notion' # notes
cask 'obsidian' # notes
cask 'jetbrains-toolbox' # jetbrains ide manager
cask 'raycast' # spotlight replacement
cask 'raindropio' # bookmark manager
cask 'hammerspoon' # automation/automation
cask 'codex' # ai coding agent
cask 'cryptomator' # encryption
cask 'ghostty' # terminal emulator
cask 'yaak' # REST client

# fonts
brew 'font-monaspice-nerd-font'
